using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace UI.Components.MyToolTip
{
  public static class ToolTipProvider
  {
    private static readonly Dictionary<string, (string Title, string Description)> _descriptions = new()
        {
            { "File", ("Работа с файлами", "Раздел для работы с файлами проекта: открытие, создание, сравнение и завершение работы приложения.") },
            { "File.Archive", ("Архив", "Просмотр архивов программ контроля.") },
            { "File.Open", ("Открыть", "Открывает указанную в проводнике программу контроля.") },
            { "File.New", ("Создать", "Создает пустой шаблон программы контроля.") },
            { "File.Save", ("Сохранить", "Сохраняет содержимое файлы.") },
            { "File.SaveAs", ("Сохранить как", "Сохраняет файл в указанную директорию.") },
            { "File.OpenFolder", ("Открыть в проводнике", "Открывает директорию, в которой лежит текущая программа контроля.") },
            { "File.Print", ("Печать", "Напечатать открытую программу контроля.") },
            { "File.Search", ("Поиск", "Поиск словосочетания в открытой программе контроля.") },
            { "File.Compare", ("Сравнить", "Сравнивает содержание двух программ контроля.") },
            { "File.Exit", ("Выход", "Завершение работы программы.") },

            { "Test", ("Испытания", "Раздел с готовыми программами контроля для проведения стандартных испытаний на работоспособность.") },
            { "Test.Metrology", ("Метрология", "Тесты для проверки точности измерения системы.") },
            { "Test.Metrology.KC", ("Режим КС", "Выполняет проверку контроля сопротивления системой.") },
            { "Test.Metrology.IE", ("Режим ИЕ", "Выполняет проверку измерения ёмкости системой.") },
            { "Test.Metrology.CI", ("Режим СИ", "Выполняет проверку сопротивления изоляции системой.") },
            { "Test.Metrology.PR", ("Режим ПР", "Выполняет проверку точек (реле) системы.") },
            { "Test.Metrology.EHT", ("Режим ЭТ", "Выполняет проверку сопротивления замкнутых точек (реле) системой.") },
            { "Test.Metrology.PIDCW", ("Режим ПИ (DCW)", "Выполняет проверку прочности изоляции постоянным напряжением.") },
            { "Test.Metrology.PIACW", ("Режим ПИ (ACW)", "Выполняет проверку прочности изоляции переменным напряжением.") },
            { "Test.Metrology.KNDCW", ("Режим КН (DCW)", "Выполняет проверку контроля напряжения постоянным напряжением.") },
            { "Test.Metrology.KNACW", ("Режим КН (ACW)", "Выполняет проверку контроля напряжения переменным напряжением.") },
            { "Test.SelfControl", ("Самоконтроль", "Проверка стойки и модулей на работоспособность.") },
            { "Test.SelfControl.Module", ("Модуль", "Проверка модулей на работоспособность.") },
            { "Test.SelfControl.System", ("Система", "Проверка стойки на работоспособность.") },
            { "Test.TestControl", ("Тесты", "Тесты для проверки работоспособности и калибровки коммутатора.") },
            { "Test.TestControl.CI", ("Тест СИ", "Проверка на разобщение точек (реле) от шины.") },
            { "Test.TestControl.CI.Node", ("Метод узла", "Проверка на разобщение методом узла.") },
            { "Test.TestControl.CI.Group", ("Групповой метод", "Проверка на разобщение групповым методом.") },
            { "Test.TestControl.PIDCW", ("Тест ПИ (DCW)", "Проверка на соединение точек (реле) с шиной постоянным напряжением.") },
            { "Test.TestControl.PIDCW.Node", ("Метод узла", "Проверка на соединение методом узла.") },
            { "Test.TestControl.PIDCW.Group", ("Групповой метод", "Проверка на соединение групповым методом.") },
            { "Test.TestControl.PIACW", ("Тест ПИ (ACW)", "Проверка на соединение точек (реле) с шиной переменным напряжением.") },
            { "Test.TestControl.PIACW.Node", ("Метод узла", "Проверка на соединение методом узла.") },
            { "Test.TestControl.PIACW.Group", ("Групповой метод", "Проверка на соединение групповым методом.") },
            { "Test.TestControl.CrossTest", ("Перекрестный тест", "Проверка на лишние подключения точек (реле) в коммутаторе.") },

            { "Execution", ("Выполнение", "Раздел, отвечающий за компиляцию, выполнение и отладку программы контроля.") },
            { "Execution.Build", ("Трансляция", "Компиляция кода программы контроля, подготовка к исполнению.") },
            { "Execution.Run", ("Запуск", "Исполнение скомпилированного кода программы контроля.") },
            { "Execution.RunStepByStepMode", ("Запуск (пошаговый режим)", "Пошаговое исполнение скомпилированного кода программы контроля.") },

            { "Setting", ("Настройки", "Раздел настройки и управления программой.") },

            { "Help", ("Справка", "Раздел помощи по программе и синтаксису ПК.") }
        };

    public static (string Title, string Description) GetDescription(string key)
    {
      if (_descriptions.TryGetValue(key, out var result))
        return result;

      return ("Описание", $"Описание не найдено для ключа: {key}");
    }
  }
}
