using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace UI.Components.MyToolTip
{
  public static class ToolTipProvider
  {
    private static readonly Dictionary<string, (string Title, string Description)> _descriptions = new()
        {
            { "File", ("Работа с файлами", "Раздел для работы с файлами проекта: открытие, создание, сравнение и завершение работы приложения.") },
            { "File.Archive", ("Архив", "Просмотр архивов программ контроля.") },
            { "File.Open", ("Открыть", "Открывает указанную в проводнике программу контроля.") },
            { "File.New", ("Создать", "Создает пустой шаблон программы контроля.") },
            { "File.Save", ("Сохранить", "Сохраняет содержимое файлы.") },
            { "File.SaveAs", ("Сохранить как", "Сохраняет файл в указанную директорию.") },
            { "File.OpenFolder", ("Открыть в проводнике", "Открывает директорию, в которой лежит текущая программа контроля.") },
            { "File.Print", ("Печать", "Напечатать открытую программу контроля.") },
            { "File.Search", ("Поиск", "Поиск словосочетания в открытой программе контроля.") },
            { "File.Compare", ("Сравнить", "Сравнивает содержание двух программ контроля.") },
            { "File.Exit", ("Выход", "Завершение работы программы.") },

            { "Test", ("Испытания", "Раздел с готовыми программами контроля для проведения стандартных испытаний на работоспособность.") },
            { "Test.Metrology", ("Метрология", "Хрен знает потом спрошу Широбокова.") },
            { "Test.Metrology.KC", ("Режим КС", "Хрен знает потом спрошу Широбокова.") },
            { "Test.Metrology.IE", ("Режим ИЕ", "Хрен знает потом спрошу Широбокова.") },
            { "Test.Metrology.CI", ("Режим СИ", "Хрен знает потом спрошу Широбокова.") },
            { "Test.Metrology.PR", ("Режим ПР", "Хрен знает потом спрошу Широбокова.") },
            { "Test.Metrology.EHT", ("Режим ЭТ", "Хрен знает потом спрошу Широбокова.") },
            { "Test.Metrology.PIDCW", ("Режим ПИ (DCW)", "Хрен знает потом спрошу Широбокова.") },
            { "Test.Metrology.PIACW", ("Режим ПИ (ACW)", "Хрен знает потом спрошу Широбокова.") },
            { "Test.Metrology.KNDCW", ("Режим КН (DCW)", "Хрен знает потом спрошу Широбокова.") },
            { "Test.Metrology.KNACW", ("Режим КН (ACW)", "Хрен знает потом спрошу Широбокова.") },
            { "Test.SelfControl", ("Самоконтроль", "Проверка стойки и модулей на работоспособность.") },
            { "Test.SelfControl.Module", ("Модуль", "Проверка модулей на работоспособность.") },
            { "Test.SelfControl.System", ("Система", "Проверка стойки на работоспособность.") },

            { "Execution", ("Выполнение", "Раздел, отвечающий за компиляцию, выполнение и отладку программы контроля.") },
            { "Execution.Build", ("Трансляция", "Компиляция кода программы контроля, подготовка к исполнению.") },
            { "Execution.Run", ("Запуск", "Исполнение скомпилированного кода программы контроля.") },
            { "Execution.RunStepByStepMode", ("Запуск (пошаговый режим)", "Пошаговое исполнение скомпилированного кода программы контроля.") },

        };

    public static (string Title, string Description) GetDescription(string key)
    {
      if (_descriptions.TryGetValue(key, out var result))
        return result;

      return ("Описание", $"Описание не найдено для ключа: {key}");
    }
  }
}
